<html>
<head>
	<title></title>
</head>
<body>
<p id="nav_name">Про веб додаток</p>
<div id="content_writing_style">
Даний веб додаток є виконанням курсової роботи на тему "Інформаційна система керування дистанційним навчанням".
<br>
З предмету : Організація баз даних та знань.
<br>
Предметна область даної роботи :
<br>
Викладачі використовують систему дистанційного навчання (далі – СДН) для надання доступу через Інтернет до навчальних матеріалів, як-от: конспекти лекцій, інструкції по лабораторних роботах, перелік тем курсових проектів і т.ін., а також для оцінювання знань студентів за допомогою тестів та контрольних робіт. 
Особа, що користується СДН, повинна бути зареєстрована як користувач, вона крім особистих даних має свій логін і пароль. Адміністратор СДН реєструє користувачів, створює навчальні дисципліни і призначає для дисциплін викладачів з множини користувачів. 
Викладач для своїх дисциплін створює групи і залучає у групи студентів з числа користувачів. Група існує лише для дисципліни.
Оцінки студентам виставляє викладач або СДН автоматично. Викладач оцінює виконання завдань (зокрема, лабораторних робіт) і контрольних робіт. СДН автоматично оцінює виконання студентами тестів.
Елементи дисципліни, які надаються студентам для вивчення як готовий матеріал, називаються ресурси. Елементи дисципліни, які потребують дій студента по демонстрації своїх знань, називаються діяльності.

</div>

</body>
</html>